Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_rights_and_conditions/contracts_of_employment/contracts_without_specific_working_hours_zero_hours_contracts.html.txt.tmx
Source language: en
Languages: ga

source: Contracts without specific working hours (zero-hours contracts)
ga: Conarthaí gan uaireanta oibre sainiúla (conarthaí uaireanta-nialasacha)

source: A zero-hours contract of employment is a type of employment contract where the employee is available for work but does not have specified hours of work
ga: Is cineál conradh fostaíochta é an conradh fostaíochta uaireanta-nialasacha áit a mbíonn an fostaí ar fáil le haghaidh oibre ach ní bhíonn uaireanta oibre sainithe aige/aici

source: If you have a zero-hours contract this means there is a formal arrangement that you are required to be available for a certain number of hours per week, or when required, or a combination of both
ga: Má tá conradh uaireanta-nialasacha agat is ionann sin agus socrú foirmiúil go bhfuil iachall ort a bheith ar fail ar feadh méid áirithe uaireanta in aghaidh na seachtaine, nó de réir mar is gá, nó meascán den dá rud

source: Employees on zero-hours contracts are protected by the Organisation of Working Time Act 1997 but this does not apply to casual employment
ga: Tugtar cosaint d'fhostaithe atá ar chonarthaí uaireanta-nialasacha faoin Acht um Eagrú Ama Oibre 1997 ach ní bhaineann sé seo le fostaíocht ócáideach

source: The Act requires that an employee under a zero-hours contract who works less than 25% of their hours in any week should be compensated
ga: Tá sé riachtanach faoin Acht go dtabharfaí cúiteamh d'fhostaí a bhfuil conradh-nialasach aige/aici ach a oibríonn níos lú ná 25% dá (h)uaireanta ina aon sheachtain amháin

source: The level of compensation depends on whether the employee got any work or none at all
ga: Braitheann an leibhéal cúitimh ar cibé an bhfuair an fostaí obair ar bith nó nach bhfuair sé/sí aon obair in aon chor

source: If the employee got no work, then the compensation should be either for 25% of the possible available hours or for 15 hours, whichever is less
ga: Mura bhfuair an fostaí obair ar bith, ansin ba chóir don chúiteamh a bheith do 25% de líon na n-uaireanta féideartha a bhí ar fáil, é sin nó do 15 uair an chloig, cibé acu is ísle

source: If the employee got some work, they should be compensated to bring them up to 25% of the possible available hours
ga: Má fuair an fostaí roinnt oibre, ba chóir dó/di cúiteamh a fháil chun é/í a thabhairt cothrom le 25% de na huaireanta féideartha a bhí ar fáil

source: For example, if you are required to be available for 20 hours per week, but you got no work, you would be entitled to be compensated for 15 hours or 25% of the 20 hours (that is, 5 hours), whichever is the less
ga: Mar shampla, má iarrtar ort a bheith ar fáil ar feadh 20 uair sa tseachtain, ach nach bhfuair tú obair ar bith, bheifeá i dteideal cúiteamh a fháil le haghaidh 15 uair an chloig nó 25% den 20 uair (i., 5 uair an chloig), cibé acu is lú

source: In this case, 5 hours is the lesser amount
ga: Sa chás seo, is é 5 uair an chloig an méid is lú

source: If, on the other hand, you got 3 hours' work out of the 20, you would be entitled to be compensated by 2 hours to bring you up to 25% of the contract hours
ga: Ar an lámh eile, má fuair tú 3 uair an chloig oibre as 20, bheifeá i dteideal cúiteamh 2 uair an chloig a fháil chun tú a thabhairt cothrom le 25% d'uaireanta an chonartha

source: You should refer disputes under the Organisation of Working Time Act 1997. You should apply within 6 months of the dispute occurring
ga: Ba chóir duit díospóidí a chur chuig an gCoimisiún um Chaidreamh san Áit Oibre de réir an Achta um Eagrú Ama Oibre 1997 laistigh de 6 mhí i ndiaidh don díospóid tarlú

source: You must use the online complaint form available on workplacerelations.ie)
ga: Ba chóir duit gearán a dhéanamh ar fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie

source: However this time limit may be extended for up to 12 months if there was reasonable cause for not bringing the complaint within the first 6 months
ga: Is féidir síneadh ama 6 mhí eile a thabhairt duit ach ní dhéanfar é sin mura bhfuil cúinsí réasúnacha ann a chuir cosc ort an gearán a dhéanamh laistigh den chéad 6 mhí

source: Further information on zero-hours contracts and your employment rights is available from the Workplace Relation Commission's Information and Customer Service - see 'Where to apply' below. Where to apply Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Tá faisnéis bhreise faoi chonarthaí uaireanta-nialasacha agus do chearta fostaíochta ar fáil ón tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre – féach ‘Cá háit a ndéanfaidh mé iarratas’ thíos
